import { supabase } from "../boot/supabase";
import { store } from "quasar/wrappers";
import { createStore } from "vuex";

export default store(function () {
  const Store = createStore({
    state: {
      MenuMobile: false,
      Menu: "",
      Gif: "",
      Social: "",
      Accounts: "",
      InsurancesList: "",
      Banner: "",
      InsuranceStep: "",
      insurancesInput: [
        {
          Step: 1,
          Label: "نوع وسیله نقلیه",
          Options: ["سواری", "بارکش"],
          Value: "",
        },
        { Step: 1, Label: "برند", Options: ["پژو", "پراید"], Value: "" },
        { Step: 1, Label: "مدل", Options: ["صندوق دار", "هاچبک"], Value: "" },
        {
          Step: 1,
          Label: "سال ساخت",
          Options: [
            "1385",
            "1386",
            "1387",
            "1388",
            "1389",
            "1390",
            "1391",
            "1392",
            "1393",
            "1394",
            "1395",
            "1396",
            "1397",
            "1398",
            "1399",
            "1400",
            "1401",
          ],
          Value: "",
        },
        {
          Step: 2,
          Label: "پلاک به نام خودتان است؟",
          Options: ["بله", "خیر"],
          Value: "",
        },
        {
          Step: 2,
          Label: "تخفیف ثالث",
          Options: [
            "0%",
            "5%",
            "10%",
            "15%",
            "20%",
            "25%",
            "30%",
            "35%",
            "40%",
            "45%",
            "50%",
            "55%",
            "60%",
            "65%",
            "70%",
          ],
          Value: "",
        },
        {
          Step: 2,
          Label: "تخفیف حوادث راننده",
          Options: [
            "0%",
            "5%",
            "10%",
            "15%",
            "20%",
            "25%",
            "30%",
            "35%",
            "40%",
            "45%",
            "50%",
            "55%",
            "60%",
            "65%",
            "70%",
          ],
          Value: "",
        },
        {
          Step: 3,
          Label: "سابقه خسارت داشته اید؟",
          Options: ["بله", "حیر"],
          Value: "",
        },
        {
          Step: 3,
          Label: "خسارت مالی",
          Options: ["یکبار", "دوبار", "سه بار"],
          Value: "",
        },
        {
          Step: 3,
          Label: "خسارت جانی",
          Options: ["یکبار", "دوبار", "سه بار"],
          Value: "",
        },
        {
          Step: 3,
          Label: "خسارت حوادث راننده",
          Options: ["یکبار", "دوبار", "سه بار"],
          Value: "",
        },
      ],
      TarikhOption: [
        {
          day: "numeric",
        },
        {
          month: "long",
        },
        {
          weekday: "long",
        },
        {
          year: "numeric",
        },
      ],
      ListQuestions: [
        {
          Question: "بیمه شخص ثالث چیست؟",
          Answer:
            "بیمه شخص ثالث یکی از انواع بیمه خودرو است که خسارات جانی و مالی وارد شده به اشخاص زیان‌دیده را پرداخت می‌کند. داشتن بیمه شخص ثالث برای تمامی وسایل نقلیه موتوری اجباری است.",
        },
        {
          Question: "منظور از شخص ثالث در بیمه شخص ثالث چیست؟",
          Answer:
            "در بیمه شخص ثالث، شخص اول شخص بیمه‌گزار (کسی که برای وسیله نقلیه‌ای بیمه شخص ثالث خریداری می‌کند)، شخص ثانی، بیمه‌گر یا شرکت بیمه و شخص ثالث فرد یا افرادی هستند در حادثه رانندگی زیان دیده‌اند به جز راننده مقصر.",
        },
        {
          Question: "داشتن بیمه شخص ثالث برای چه کسانی الزامی است؟",
          Answer:
            "طبق قانون، داشتن بیمه شخص ثالث برای تمامی دارندگان وسایل نقلیه موتوری (سواری، مسافری، خودروی بارکش، موتور سیکلت و ...) الزامی است.",
        },
        {
          Question: "کارت ماشین ندارم باید چکار کنم؟",
          Answer: "اگر برگه سبز خود را دارید می‌توانید آن را آپلود کنید.",
        },
        {
          Question: "نداشتن بیمه شخص ثالث، چه مشکلاتی برای من ایجاد میکند؟",
          Answer:
            "اولاً حرکت وسیله نقلیه بدون داشتن بیمه شخص ثالث، ممنوع است و پلیس راهنمایی رانندگی در هر زمانی که متوجه نداشتن بیمه شخص ثالث یک وسیله نقلیه شود، می‌تواند آن را توقیف کند. درصورتی‌که یک وسیله نقلیه دارای بیمه‌نامه شخص ثالث نباشد و دچار حادثه شود، راننده تا زمان پرداخت خسارت جانی و مالی اشخاص زیان‌دیده، زندانی می‌شود. همچنین، در هر زمان که راننده بخواهد بیمه شخص ثالث بخرد، باید جریمه دیرکرد آن را که قابل بخشش نیست، بپردازد. از سوی دیگر، فروش وسیله نقلیه فاقد بیمه شخص ثالث، امکان‌پذیر نیست.",
        },
        {
          Question: "بیمه شخص ثالث برای من چه فایده ای دارد؟",
          Answer:
            "علاوه بر آنکه خرید بیمه شخص ثالث برای تمامی دارندگان وسایل نقلیه موتوری الزامی است، داشتن این بیمه می‌تواند خسارات مالی و جانی ناشی از بروز حادثه را که می‌تواند تا مرز صدها میلیون تومان باشد، جبران نماید.",
        },
        {
          Question: "خسارت مالی دربیمه شخص ثالث به چه معناس؟",
          Answer:
            "خسارت مالی در بیمه شخص ثالث، به معنای خسارتی است که در جریان حادثه به اموال اشخاص ثالث وارد می‌شود.",
        },
        {
          Question: "خسارت جانی در بیمه شخص ثالث به چه معناس",
          Answer:
            "آسیب جانی که در جریان حادثه به جسم انسان (و نه هر موجود زنده دیگری) وارد می‌شود، خسارت جانی نامیده می‌شود.",
        },
        {
          Question:
            "اگر گواهینامه نداشته باشم آیا بیمه شخص ثالث خاسرت وارد شده به من را جبران میکند؟",
          Answer:
            "در صورتی که گواهینامه نداشته باشید باید تمامی هزینه خسارت به بارآمده را خودتان تقبل کنید و شرکت بیمه هیچ هزینه‌ای را بر عهده نخواهد گرفت",
        },
        {
          Question:
            "الحاقیه بیمه شخص ثالث چیست؟ چه زمانی به الحاقیه بیمه شخص ثالث نیاز دارم؟",
          Answer:
            "تخفیف عدم خسارت بیمه شخص ثالث یا همان 'ت‌ع‌خ' بر اساس تعداد سال‌هایی که فرد از بیمه‌نامه خود استفاده نکرده است تعیین می‌شود. تخفیف عدم خسارت برای یک سال 10%برای دو سال 15% برای سه سال 20% برای چهار سال 30% برای پنج سال 40% برای شش سال 50% برای هفت سال 60% و برای هشت سال به بالا 70% است.",
        },
        {
          Question:
            "بیمه شخص ثالث من گم شده است / به سرقت رفته است ، چه کاری باید انجام بدهم؟",
          Answer:
            "در صورت مفقود شدن بیمه‌نامه باید سریعاً با به همراه داشتن کارت شناسایی و کارت ماشین به مجتمع بیمه‌ای که بیمه‌نامه از آن دریافت شده است مراجعه کنید و گواهی بیمه شخص ثالث را دریافت کنید. برای بیمه شخص ثالث المثنی صادر نمی‌شود.",
        },
        {
          Question: "آیا میتوانم بیمه شخص ثالث کوتاه مدت بخرم؟",
          Answer:
            "می‌توانید مدت اعتبار بیمه‌نامه شخص ثالث را خودتان انتخاب کنید. بیمه شخص ثالث به صورت روزانه نیز ارائه می‌شود. البته این بستگی به شرکت بیمه دارد. برخی از شرکت‌های بیمه در انتخاب مدت اعتبار بیمه‌نامه محدودیت قائل می‌شوند و برخی به صورت هفتگی و روزانه بیمه شخص ثالث ارائه می‌دهند که البته به لحاظ قیتی خرید بیمه شخص ثالث کوتاه مدت به‌صرفه نیست.",
        },
        {
          Question: "کدام بیمه شخص ثالث برای من بهتر است؟",
          Answer:
            "بهترین بیمه شخص ثالث برای هر کس با توجه به اولویت‌ها و شرایطش تعریف می‌شود. برای یافتن بهترین بیمه شخص ثالث برای خود بهترین کار استفاده از سامانه استعلام و خرید آنلاین بیمیتو است که امکان مقایسه کیفیت، شرایط و قیمت تمامی شرکت‌های بیمه را در اختیارتان قرار می‌دهد.",
        },
        {
          Question:
            "آیا میتوانم از تخفیف بیمه شخص ثالث خودروی قبلیم برای ماشین جدیدی که می خرم ،استفاده کنم؟",
          Answer:
            "بله. می‌توانید تخفیف بیمه شخص ثالث خودروی قبلیتان را به بیمه شخص ثالث خودروی جدیدتان انتقال دهید.",
        },
        {
          Question: "چقدر طول میکشد بیمه شخص ثالث ،دیه را پرداخت کند؟",
          Answer:
            "بستگی به شرکت بیمه دارد. در بعضی از مواقع شرکت بیمه بعد از رای دادگاه دیه را پرداخت می‌کند. در بعضی مواقع نیز شرکت بیمه با توجه به خسارت تخمینی توسط کارشناس بیمه قبل از رای دادگاه پیش‌پرداختی را انجام می‌دهد. به صورت معمول شرکت بیمه به محض اعلام رای دادگاه موظف به پرداخت دیه است.",
        },
        {
          Question: "برای دریاف خسارت بیمه شخص ثالث ، چه مدارکی لازم دارم ؟",
          Answer:
            "برای دریافت خسارت مالی، اگر برای تصادف کروکی دارید، نیاز به اصل کروکی، اصل و رونوشت کارت خودرو، بیمه‌نامه و گواهینامه زیان‌دیده و مقصر حادثه و اصل برش کوپن مقصر نیاز دارید. درصورتی‌که کروکی تصادف غیرسازشی باشد، همراه داشتن رونوشت کروکی حادثه و مدارک قضائی نیز لازم است. در تصادفات جرحی یا تصادفاتی که به اموال دولتی خسارت وارد شده است، حضور مقصر حادثه در هنگام پرداخت خسارت الزامی است.",
        },
        {
          Question:
            "اگر سررسیدم  بیستم باشه وپنجم درخواست بدم چه تاریخی توی بیمه نامم میخوره؟",
          Answer:
            "اگر زودتر از موعد سررسید خود بیمه بخرید همان سررسید قبلی توی بیمه‌نامه شما درج می‌شود. یعنی در این مورد همان تاریخ 20ام قرار می‌گیرد. اما اگر تاریخ سررسیدتان گذشته باشد؛ مثلاً سررسید شما 20ام باشد ولی شما 25ام بیمه خریداری کنید تاریخ 25ام به‌عنوان تاریخ سررسید بیمه شما ثبت می‌شود.",
        },
        {
          Question:
            "اگر زود تر بیمه نامه بخرم و تصادف کنم تکلیف بیمه نامم چی میشه؟",
          Answer:
            "فرض کنید شما تاریخ سررسیدتان 20ام هست ولی 10ام بیمه‌نامه خریدید. در این 10 روز اگر تصادفی داشته باشید از بیمه‌نامه قبلی خود باید استفاده کنید. اگر آن را به بیمیتو تحویل داده باشید در صورت بروز حادثه، یکی از کوپن‌های بیمه‌نامه قبلی به شما پس داده می‌شود.",
        },
        {
          Question: "چرا شرکت های بیمه اینقدر تفاوت قیمت دارند؟",
          Answer:
            "سیاست‌گذاری شرکت‌ها برای تعیین قیمت بیمه‌های خود باهم متفاوت است. یعنی بعضی از شرکت‌ها برای جذب مشتری بیشتر قیمت‌های ارزان‌تری در نظر گرفته و بعضی‌ها نیازی به این سیاست ندارند. معمولاً همه شرکت‌ها به‌صورت دوره‌ای تخفیف‌هایی را برای بیمه‌های خود در نظر می‌گیرند.",
        },
        {
          Question: "ماشینمو میخوام بفروشم چطوری میتونم تفیفاتشو منتقل کنم؟",
          Answer:
            "فرض کنید شما قصد فروش خودروی خود را دارید که این خودرو شش سال تخفیف عدم خسارت دارد. شما می‌خواهید این خودرو را بدون تخفیف‌های عدم خسارتش بفروشید و تخفیف آن را برای خودروی بعدی خود نگه دارید. برای انجام این کار شما باید الحاقیه انتقال تخفیف را تهیه کنید. روند این کار به این صورت است که شما باید به شرکت بیمه‌گر بیمه‌نامه فعلی خود مراجعه کنید. سند فروش خودرو، کارت ماشین و مدارک شناسایی خود را ارائه داده و تقاضای خود را ثبت کنید. برای اینکه تخفیف‌های خودروی فعلی شما صفر شود و شما بتوانید تخفیف‌های آن را برای خودروی بعدی خود نگه دارید، نیاز است تا مبلغی را به شرکت بیمه‌گر بپردازید که این مبلغ در شرکت‌های مختلف، متفاوت است.",
        },
        {
          Question: "اگر بیمه ناممم گم بشه تخفیف عدم خسارت حفظ میشه؟",
          Answer:
            "تخفیف‌ها عدم خسارت شما در صورت گم شدن بیمه‌نامه از بین نمی‌رود اما برای تمدید بیمه‌نامه خود در موعد سررسید، باید از همان شرکت بیمه‌گر قبلی اقدام به تمدید کنید تا تخفیف‌های عدم خسارت بیمه شخص ثالث شما لحاظ شود.",
        },
      ],
      TabInfo: [
        {
          Img: "car",
          Title: "بیمه شخص ثالث",
          Info: "در میان انواع طرح‌های بیمه‌ای که از جانب شرکت‌های مختلف ارائه می‌شوند، بیمه شخص ثالث همچنان پرمخاطب‌ترین نوع بیمه است. بدون شک یکی از دلایل اصلی سهم بالای بیمه شخص ثالث در بازار ایران، اجباری بودن این بیمه است. به‌صورتی‌که اگر وسیله نقلیه‌ای تحت این پوشش نباشد، ممکن است عواقب جبران‌ناپذیری داشته باشد که به آن خواهیم پرداخت.اما به‌راستی بیمه شخص ثالث چه مواردی را پوشش می‌دهد و علت نام‌گذاری این بیمه چیست. در پوشش بیمه شخص ثالث، شخص اول مالک وسیله نقلیه یا بیمه‌گزار، شخص ثانی شرکت بیمه یا بیمه‌گر و شخص ثالث فرد زیان‌دیده غیر از راننده مقصر در حادثه هستند.برای مثال در یک حادثه رانندگی هزینه درمان، فوت و خسارت وارد شده به اموال تمامی افراد زیان‌دیده، تحت پوشش بیمه شخص ثالث قرار می‌گیرد. راننده مقصر نیز تحت پوشش بیمه حوادث راننده که به تازگی جزئی از بیمه شخص ثالث شده است قرار می‌گیرد. با این تفاوت که بیمه حوادث راننده تنها خسارت‌های جانی را پوشش می‌دهد و در برابر خسارات مالی مسئولیتی نداردبیمه شخص ثالث را تمامی شرکت‌های بیمه ارائه می‌دهند و نرخ بیمه در شرکت‌های مختلف می‌تواند متفاوت باشد. همچنین تفاوت در کیفیت ارائه خدمات این بیمه می‌تواند تأثیر بسزایی در میزان رضایت بیمه‌گزار داشته باشد. در ادامه به بررسی بهترین بیمه شخص ثالث نیز خواهیم پرداخت.",
        },
        {
          Img: "mony",
          Title: "محاسبه بیمه ثالث",
          Info: "در اولین قدم به این می‌پردازیم که حق بیمه شخص ثالث بر چه اساسی تعیین می‌شود و سپس به عوامل مؤثر بر قیمت نهایی خواهیم پرداخت.",
        },
        {
          Img: "center",
          Title: "حق بیمه پایه",
          Info: "اساس تعیین حق بیمه شخص ثالث و میزان پوشش مالی و جانی که به آن خواهیم پرداخت مبلغ تعیین‌شده برای دیه کامل یک انسان در ماه حرام است. هر ساله قوه قضائیه میزان مشخصی را به عنوان حق دیه کامل در ماه حرام اعلام می‌کند. در سال 1400 دیه کامل در ماه حرام 640 میلیون تومان و در ماه غیرحرام 480 میلیون تومان تعیین شده است. در تقویم قمری چهار ماه‌ ذی‌القعده، ذی‌الحجه، محرم و رجب ماه‌های حرام به شمار می‌آیند. بدین معنی که اگر فوت ناشی از حادثه رانندگی در یکی از این چهار ماه رخ دهد میزان دیه 640 میلیون تومان و در باقی ماه‌های سال 480 میلیون تومان خواهد بود. بر همین اساس حداقل پوشش مالی نیز در سال 1400، 16 میلیون تومان تعیین شده است که یک چهلم دیه کامل در ماه حرام است. بیمه مرکزی بر اساس این مبلغ، حق بیمه‌ را به شرکت‌های بیمه ابلاغ می‌کند. این مبلغ پایه حق بیمه خواهد بود. در مراحل بعدی می‌توان با استفاده از تخفیف‌ها و تغییر برخی از فاکتورهای مؤثر بر حق بیمه، قیمت بیمه شخص ثالث را کاهش یا افزایش داد.",
        },
        {
          Img: "offer",
          Title: " عدم خسارت",
          Info: "در سال 1400 قانون تخفیف بیمه شخص ثالث تغییر کرده است. به این صورت که دیگر بعد از خرید یک خودرو، تخفیف‌هایی که متعلق به مالک قبلی است به شما منتقل نمی‌شود و برای تمدید بیمه شخص ثالث نمی‌توانید از آن تخفیف‌ها استفاده کنید.البته هر شخص می‌تواند تخفیف‌هایی را که به نامش است برای خود حفظ کند؛ یعنی شما می‌توانید تخفیف ماشین قبلی خود را (که به نام خودتان بوده) به خودروی جدید خود یا به خودروی بستگان درجه اول مثل والدین، همسر و فرزندان منتقل کنید.اگر تخفیف‌های بیمه‌نامه فعلی به نام خودتان است و تغییر مالکیتی هم برای خودرو ایجاد نشده است، می‌توانید درصد تخفیفی را که بر روی بیمه‌نامه نوشته شده است، در سایت بیمیتو وارد کنید.در گام بعدی اینکه در مدت بیمه‌نامه قبلی از آن استفاده کردید یا نه اهمیت دارد. اگر در این مدت از بیمه‌نامه خودرو استفاده کرده باشید باید تعداد خسارت‌های جانی، مالی و حوادث راننده را نیز از روی بیمه‌نامه بخوانید. درصورتی‌که از بیمه‌نامه خودرو استفاده کرده باشید بر روی آن یک مهر زده شده که تعداد خسارت و نوع آن توسط مرکز پرداخت خسارت شرکت بیمه مشخص است. با استفاده از درصد تخفیف بیمه‌نامه و اینکه در این مدت از بیمه‌نامه استفاده کردید یا نه می‌توانید میزان تخفیف عدم خسارت بیمه‌نامه خود را محاسبه کنید و استعلام قیمت بیمه شخص ثالث بگیرید.",
        },
        {
          Img: "taxi",
          Title: "کاربری خودرو",
          Info: "کاربری خودرو تعیین‌کننده میزان ریسک خودرو برای رخ دادن حادثه و همچنین میزان هزینه معمول در یک حادثه رانندگی است. برای مثال خودروهای تاکسی یا آموزش رانندگی، بیشتر در معرض حوادث رانندگی هستند و باید حق بیمه شخص ثالث بیشتری را پرداخت کنند. تاکسی‌ها موظف به پرداخت 20% حق بیمه ثالث بیشتر و خودروهای آموزش رانندگی موظف به پرداخت 15% حق بیمه ثالث بیشتر هستند. کاربری‌های دیگری نیز تعریف شده‌است که برخی از آن‌ها صنعتی، آمبولانس و حمل خون و آتش‌نشانی، بارکش، عمومی سازمانی و ... هستند.",
        },
        {
          Img: "penalty",
          Title: "جریمه دیرکرد",
          Info: "در مقابل تخفیف عدم خسارت بیمه شخص ثالث، جریمه دیرکرد آن موجب افزایش حق بیمه می‌شود. همان‌طور که اشاره کردیم بیمه شخص ثالث برای تمامی دارندگان وسایل نقلیه اجباری است. درصورتی‌که در تمدید بیمه شخص ثالث وقفه‌ای بیفتد به صورت روزشمار مبلغی به حق بیمه ماشین اضافه خواهد شد که برای خودروهای مختلف متفاوت است. اضافه شدن جریمه دیرکرد به حق بیمه ماشین به صورت روزشمار تنها تا 365 روز محاسبه و اعمال می‌شود؛ به این صورت که جریمه دیرکرد یک سال با دو سال فرقی ندارد.          ",
        },
        {
          Img: "dolar",
          Title: "میزان پوشش",
          Info: "میزان پوشش از موارد دیگری است که تعیین‌کننده حق بیمه ماشین است. پوشش به معنای تعهد مالی شرکت بیمه در مقابل بیمه‌گزار است. حداقل میزان پوشش مالی تعیین شده از جانب بیمه مرکزی در سال 1400، 16 میلیون تومان است. بیمه‌گزار می‌تواند با پرداخت حق بیمه بیشتر، پوشش مالی بالاتری را خریداری کند. برای مثال اگر خسارت وارد‌شده به زیان‌دیده در یک حادثه رانندگی 20 میلیون تومان باشد و فرد مقصر حداقل میزان پوشش مالی را خریداری کرده باشد، باید مابه‌تفاوت 4 میلیون تومان خسارت وارد‌شده را شخصاً تقبل کند در صورتی‌که با پرداخت حق بیمه اندکی بیشتر و خرید پوشش 20 میلیون تومانی لازم نبود هیچ هزینه‌ای را جدا از خسارت پرداختی شرکت بیمه بپردازد. همان‌طور که می‌دانید در چند سال گذشته قیمت ماشین رشد چند برابری داشته به همین دلیل ممکن است در تصادف با یک خودروی گران‌قیمت خسارت واردشده بیشتر از پوشش پایه بیمه ثالث باشد؛ بنابراین توصیه می‌شود حتماً پوشش مالی بیمه شخص ثالث ماشین خود را بالا انتخاب کنید و به پوشش پایه این بیمه اکتفا نکنید. با خرید بیمه شخص ثالث از بیمیتو می‌توانید ببینید هر شرکت بیمه چه پوشش‌های مالی را ارائه می‌دهد و قیمت هر یک چقدر است.",
        },
        {
          Img: "discount",
          Title: "تخفیف  بیمه",
          Info: "در سال‌های گذشته بیمه مرکزی هر ساله حداقل و حداکثر حق بیمه را به شرکت‌های بیمه ابلاغ می‌کرد و شرکت‌های بیمه می‌توانستند در این بازه قیمتی، مبلغی را که برایشان مطلوب بود به عنوان حق بیمه ثالث به متقاضیان بیمه شخص ثالث اعلام ‌کنند؛ در حال حاضر بعضی از شرکت‌های بیمه تخفیف‌هایی دوره‌ای و موقتی را بر روی نرخ بیمه ارائه می‌دهند و بعضی خیر؛ بنابراین قیمت بیمه شخص ثالث شرکت‌های مختلف با یکدیگر تفاوت دارد. علاوه بر تخفیف شرکت بیمه تخفیف عدم خسارت بیمه‌نامه قبلی شما نیز بر نرخ بیمه شما تاثیر می‌گذارد و در استعلام نرخ بیمه شخص ثالث باید آن را اعمال کنید.",
        },
        {
          Img: "timer",
          Title: "مدت اعتبار",
          Info: "مدت اعتبار بیمه ‌نامه شخص ثالث می‌تواند از چند روز تا یک سال باشد. برخی از شرکت‌های بیمه، بیمه شخص ثالث را به صورت روزشمار نیز ارائه می‌دهند. در کل خرید بیمه نامه شخص ثالث به صورت سالانه مقرون‌به‌صرفه‌تر است. برای مثال قیمت بیمه‌نامه شش ماهه از نصف قیمت بیمه‌نامه یک ساله بیشتر است. چرا که بیمه‌های کوتاه مدت برای شرکت‌های بیمه ریسک بیشتری دارند.",
        },
      ],
    },
    mutations: {
      Menu(state, data) {
        state.Menu = data;
      },
      Social(state, data) {
        state.Social = data;
      },
      Accounts(state, data) {
        state.Accounts = data;
      },
      MenuMobileBtn(state) {
        state.MenuMobile = !state.MenuMobile;
      },
      Banner(state, data) {
        state.Banner = data;
      },
      Gif(state, data) {
        state.Gif = URL.createObjectURL(data);
      },
      InsurancesList(state, data) {
        state.InsurancesList = data;
      },
      InsuranceStep(state, data) {
        state.InsuranceStep = data;
      },
      HandelInputInsurence(state, { Data, index }) {
        state.insurancesInput[index].Value = Data;
      },
    },
    actions: {
      async SupabaseMenu({ commit }) {
        try {
          const { data } = await supabase.from("Menu").select("*");
          commit("Menu", data);
        } catch (error) {
          console.log(error.message);
          console.log("لیست منو دریافت نشد");
        }
      },
      async SupabaseSocial({ commit }) {
        try {
          const { data } = await supabase.from("Social").select("*");
          commit("Social", data);
        } catch (error) {
          console.log(error.message);
          console.log("لیست منو دریافت نشد");
        }
      },
      async SupabaseAccounts({ commit }) {
        try {
          const { data } = await supabase.from("Accounts").select("*");
          commit("Accounts", data);
        } catch (error) {
          console.log(error.message);
          console.log("لیست منو دریافت نشد");
        }
      },
      async SupabaseBanner({ commit }) {
        try {
          const { data } = await supabase.from("Banner").select("*");
          commit("Banner", data);
        } catch (error) {
          console.log(error.message);
          console.log("اطلاعات بنر های قرمز زرد و سبز دریافت نشد");
        }
      },
      async SupabaseInsuranceStep({ commit }) {
        try {
          const { data } = await supabase.from("InsuranceCar").select("*");
          commit("InsuranceStep", data);
        } catch (error) {
          console.log(error.message);
          console.log("اطلاعات،فرم دریافت نشد");
        }
      },
      async SupabaseGif({ commit }) {
        try {
          const { data } = await supabase.storage
            .from("public")
            .download("gif/Gif-Tabligh.gif");
          commit("Gif", data);
        } catch (error) {
          console.log(error.message);
          console.log("گیف دریافت نشد");
        }
      },
      async SupabaseInsurancesList({ commit }) {
        try {
          const InsurancesList = [];
          for (let index = 1; index < 13; index++) {
            const { data } = await supabase.storage
              .from("public")
              .download(`insurances/Bimeh/${index}.png`);
            InsurancesList.push(URL.createObjectURL(data));
          }
          commit("InsurancesList", InsurancesList);
        } catch (error) {
          console.log(error.message);
          console.log("گیف دریافت نشد");
        }
      },
    },
    getters: {
      StateGetter: (state) => (name) => {
        return state[name];
      },
    },
    modules: {},

    strict: process.env.DEBUGGING,
  });

  return Store;
});
