import { supabase } from "../boot/supabase";
import { store } from "quasar/wrappers";
import { createStore } from "vuex";

export default store(function () {
  const Store = createStore({
    state: {
      MenuMobile: false,
      Menu: "",
      Gif: "",
      Social: "",
      Accounts: "",
      InsurancesList: "",
      Banner: "",
      InsuranceStep: "",
      InsuranceInfo: "",
      insurancesInput: [
        {
          Step: 1,
          Label: "نوع وسیله نقلیه",
          Options: ["سواری", "بارکش"],
          Value: "",
        },
        { Step: 1, Label: "برند", Options: ["پژو", "پراید"], Value: "" },
        { Step: 1, Label: "مدل", Options: ["صندوق دار", "هاچبک"], Value: "" },
        {
          Step: 1,
          Label: "سال ساخت",
          Options: [
            "1385",
            "1386",
            "1387",
            "1388",
            "1389",
            "1390",
            "1391",
            "1392",
            "1393",
            "1394",
            "1395",
            "1396",
            "1397",
            "1398",
            "1399",
            "1400",
            "1401",
          ],
          Value: "",
        },
        {
          Step: 2,
          Label: "پلاک به نام خودتان است؟",
          Options: ["بله", "خیر"],
          Value: "",
        },
        {
          Step: 2,
          Label: "تخفیف ثالث",
          Options: [
            "0%",
            "5%",
            "10%",
            "15%",
            "20%",
            "25%",
            "30%",
            "35%",
            "40%",
            "45%",
            "50%",
            "55%",
            "60%",
            "65%",
            "70%",
          ],
          Value: "",
        },
        {
          Step: 2,
          Label: "تخفیف حوادث راننده",
          Options: [
            "0%",
            "5%",
            "10%",
            "15%",
            "20%",
            "25%",
            "30%",
            "35%",
            "40%",
            "45%",
            "50%",
            "55%",
            "60%",
            "65%",
            "70%",
          ],
          Value: "",
        },
        {
          Step: 3,
          Label: "سابقه خسارت داشته اید؟",
          Options: ["بله", "حیر"],
          Value: "",
        },
        {
          Step: 3,
          Label: "خسارت مالی",
          Options: ["یکبار", "دوبار", "سه بار"],
          Value: "",
        },
        {
          Step: 3,
          Label: "خسارت جانی",
          Options: ["یکبار", "دوبار", "سه بار"],
          Value: "",
        },
        {
          Step: 3,
          Label: "خسارت حوادث راننده",
          Options: ["یکبار", "دوبار", "سه بار"],
          Value: "",
        },
      ],
      TarikhOption: [
        {
          day: "numeric",
        },
        {
          month: "long",
        },
        {
          weekday: "long",
        },
        {
          year: "numeric",
        },
      ],
      ListQuestions: [
        {
          Question: "بیمه شخص ثالث چیست؟",
          Answer:
            "بیمه شخص ثالث یکی از انواع بیمه خودرو است که خسارات جانی و مالی وارد شده به اشخاص زیان‌دیده را پرداخت می‌کند. داشتن بیمه شخص ثالث برای تمامی وسایل نقلیه موتوری اجباری است.",
        },
        {
          Question: "منظور از شخص ثالث در بیمه شخص ثالث چیست؟",
          Answer:
            "در بیمه شخص ثالث، شخص اول شخص بیمه‌گزار (کسی که برای وسیله نقلیه‌ای بیمه شخص ثالث خریداری می‌کند)، شخص ثانی، بیمه‌گر یا شرکت بیمه و شخص ثالث فرد یا افرادی هستند در حادثه رانندگی زیان دیده‌اند به جز راننده مقصر.",
        },
        {
          Question: "داشتن بیمه شخص ثالث برای چه کسانی الزامی است؟",
          Answer:
            "طبق قانون، داشتن بیمه شخص ثالث برای تمامی دارندگان وسایل نقلیه موتوری (سواری، مسافری، خودروی بارکش، موتور سیکلت و ...) الزامی است.",
        },
        {
          Question: "کارت ماشین ندارم باید چکار کنم؟",
          Answer: "اگر برگه سبز خود را دارید می‌توانید آن را آپلود کنید.",
        },
        {
          Question: "نداشتن بیمه شخص ثالث، چه مشکلاتی برای من ایجاد میکند؟",
          Answer:
            "اولاً حرکت وسیله نقلیه بدون داشتن بیمه شخص ثالث، ممنوع است و پلیس راهنمایی رانندگی در هر زمانی که متوجه نداشتن بیمه شخص ثالث یک وسیله نقلیه شود، می‌تواند آن را توقیف کند. درصورتی‌که یک وسیله نقلیه دارای بیمه‌نامه شخص ثالث نباشد و دچار حادثه شود، راننده تا زمان پرداخت خسارت جانی و مالی اشخاص زیان‌دیده، زندانی می‌شود. همچنین، در هر زمان که راننده بخواهد بیمه شخص ثالث بخرد، باید جریمه دیرکرد آن را که قابل بخشش نیست، بپردازد. از سوی دیگر، فروش وسیله نقلیه فاقد بیمه شخص ثالث، امکان‌پذیر نیست.",
        },
        {
          Question: "بیمه شخص ثالث برای من چه فایده ای دارد؟",
          Answer:
            "علاوه بر آنکه خرید بیمه شخص ثالث برای تمامی دارندگان وسایل نقلیه موتوری الزامی است، داشتن این بیمه می‌تواند خسارات مالی و جانی ناشی از بروز حادثه را که می‌تواند تا مرز صدها میلیون تومان باشد، جبران نماید.",
        },
        {
          Question: "خسارت مالی دربیمه شخص ثالث به چه معناس؟",
          Answer:
            "خسارت مالی در بیمه شخص ثالث، به معنای خسارتی است که در جریان حادثه به اموال اشخاص ثالث وارد می‌شود.",
        },
        {
          Question: "خسارت جانی در بیمه شخص ثالث به چه معناس",
          Answer:
            "آسیب جانی که در جریان حادثه به جسم انسان (و نه هر موجود زنده دیگری) وارد می‌شود، خسارت جانی نامیده می‌شود.",
        },
        {
          Question:
            "اگر گواهینامه نداشته باشم آیا بیمه شخص ثالث خاسرت وارد شده به من را جبران میکند؟",
          Answer:
            "در صورتی که گواهینامه نداشته باشید باید تمامی هزینه خسارت به بارآمده را خودتان تقبل کنید و شرکت بیمه هیچ هزینه‌ای را بر عهده نخواهد گرفت",
        },
        {
          Question:
            "الحاقیه بیمه شخص ثالث چیست؟ چه زمانی به الحاقیه بیمه شخص ثالث نیاز دارم؟",
          Answer:
            "تخفیف عدم خسارت بیمه شخص ثالث یا همان 'ت‌ع‌خ' بر اساس تعداد سال‌هایی که فرد از بیمه‌نامه خود استفاده نکرده است تعیین می‌شود. تخفیف عدم خسارت برای یک سال 10%برای دو سال 15% برای سه سال 20% برای چهار سال 30% برای پنج سال 40% برای شش سال 50% برای هفت سال 60% و برای هشت سال به بالا 70% است.",
        },
        {
          Question:
            "بیمه شخص ثالث من گم شده است / به سرقت رفته است ، چه کاری باید انجام بدهم؟",
          Answer:
            "در صورت مفقود شدن بیمه‌نامه باید سریعاً با به همراه داشتن کارت شناسایی و کارت ماشین به مجتمع بیمه‌ای که بیمه‌نامه از آن دریافت شده است مراجعه کنید و گواهی بیمه شخص ثالث را دریافت کنید. برای بیمه شخص ثالث المثنی صادر نمی‌شود.",
        },
        {
          Question: "آیا میتوانم بیمه شخص ثالث کوتاه مدت بخرم؟",
          Answer:
            "می‌توانید مدت اعتبار بیمه‌نامه شخص ثالث را خودتان انتخاب کنید. بیمه شخص ثالث به صورت روزانه نیز ارائه می‌شود. البته این بستگی به شرکت بیمه دارد. برخی از شرکت‌های بیمه در انتخاب مدت اعتبار بیمه‌نامه محدودیت قائل می‌شوند و برخی به صورت هفتگی و روزانه بیمه شخص ثالث ارائه می‌دهند که البته به لحاظ قیتی خرید بیمه شخص ثالث کوتاه مدت به‌صرفه نیست.",
        },
        {
          Question: "کدام بیمه شخص ثالث برای من بهتر است؟",
          Answer:
            "بهترین بیمه شخص ثالث برای هر کس با توجه به اولویت‌ها و شرایطش تعریف می‌شود. برای یافتن بهترین بیمه شخص ثالث برای خود بهترین کار استفاده از سامانه استعلام و خرید آنلاین بیمیتو است که امکان مقایسه کیفیت، شرایط و قیمت تمامی شرکت‌های بیمه را در اختیارتان قرار می‌دهد.",
        },
        {
          Question:
            "آیا میتوانم از تخفیف بیمه شخص ثالث خودروی قبلیم برای ماشین جدیدی که می خرم ،استفاده کنم؟",
          Answer:
            "بله. می‌توانید تخفیف بیمه شخص ثالث خودروی قبلیتان را به بیمه شخص ثالث خودروی جدیدتان انتقال دهید.",
        },
        {
          Question: "چقدر طول میکشد بیمه شخص ثالث ،دیه را پرداخت کند؟",
          Answer:
            "بستگی به شرکت بیمه دارد. در بعضی از مواقع شرکت بیمه بعد از رای دادگاه دیه را پرداخت می‌کند. در بعضی مواقع نیز شرکت بیمه با توجه به خسارت تخمینی توسط کارشناس بیمه قبل از رای دادگاه پیش‌پرداختی را انجام می‌دهد. به صورت معمول شرکت بیمه به محض اعلام رای دادگاه موظف به پرداخت دیه است.",
        },
        {
          Question: "برای دریاف خسارت بیمه شخص ثالث ، چه مدارکی لازم دارم ؟",
          Answer:
            "برای دریافت خسارت مالی، اگر برای تصادف کروکی دارید، نیاز به اصل کروکی، اصل و رونوشت کارت خودرو، بیمه‌نامه و گواهینامه زیان‌دیده و مقصر حادثه و اصل برش کوپن مقصر نیاز دارید. درصورتی‌که کروکی تصادف غیرسازشی باشد، همراه داشتن رونوشت کروکی حادثه و مدارک قضائی نیز لازم است. در تصادفات جرحی یا تصادفاتی که به اموال دولتی خسارت وارد شده است، حضور مقصر حادثه در هنگام پرداخت خسارت الزامی است.",
        },
        {
          Question:
            "اگر سررسیدم  بیستم باشه وپنجم درخواست بدم چه تاریخی توی بیمه نامم میخوره؟",
          Answer:
            "اگر زودتر از موعد سررسید خود بیمه بخرید همان سررسید قبلی توی بیمه‌نامه شما درج می‌شود. یعنی در این مورد همان تاریخ 20ام قرار می‌گیرد. اما اگر تاریخ سررسیدتان گذشته باشد؛ مثلاً سررسید شما 20ام باشد ولی شما 25ام بیمه خریداری کنید تاریخ 25ام به‌عنوان تاریخ سررسید بیمه شما ثبت می‌شود.",
        },
        {
          Question:
            "اگر زود تر بیمه نامه بخرم و تصادف کنم تکلیف بیمه نامم چی میشه؟",
          Answer:
            "فرض کنید شما تاریخ سررسیدتان 20ام هست ولی 10ام بیمه‌نامه خریدید. در این 10 روز اگر تصادفی داشته باشید از بیمه‌نامه قبلی خود باید استفاده کنید. اگر آن را به بیمیتو تحویل داده باشید در صورت بروز حادثه، یکی از کوپن‌های بیمه‌نامه قبلی به شما پس داده می‌شود.",
        },
        {
          Question: "چرا شرکت های بیمه اینقدر تفاوت قیمت دارند؟",
          Answer:
            "سیاست‌گذاری شرکت‌ها برای تعیین قیمت بیمه‌های خود باهم متفاوت است. یعنی بعضی از شرکت‌ها برای جذب مشتری بیشتر قیمت‌های ارزان‌تری در نظر گرفته و بعضی‌ها نیازی به این سیاست ندارند. معمولاً همه شرکت‌ها به‌صورت دوره‌ای تخفیف‌هایی را برای بیمه‌های خود در نظر می‌گیرند.",
        },
        {
          Question: "ماشینمو میخوام بفروشم چطوری میتونم تفیفاتشو منتقل کنم؟",
          Answer:
            "فرض کنید شما قصد فروش خودروی خود را دارید که این خودرو شش سال تخفیف عدم خسارت دارد. شما می‌خواهید این خودرو را بدون تخفیف‌های عدم خسارتش بفروشید و تخفیف آن را برای خودروی بعدی خود نگه دارید. برای انجام این کار شما باید الحاقیه انتقال تخفیف را تهیه کنید. روند این کار به این صورت است که شما باید به شرکت بیمه‌گر بیمه‌نامه فعلی خود مراجعه کنید. سند فروش خودرو، کارت ماشین و مدارک شناسایی خود را ارائه داده و تقاضای خود را ثبت کنید. برای اینکه تخفیف‌های خودروی فعلی شما صفر شود و شما بتوانید تخفیف‌های آن را برای خودروی بعدی خود نگه دارید، نیاز است تا مبلغی را به شرکت بیمه‌گر بپردازید که این مبلغ در شرکت‌های مختلف، متفاوت است.",
        },
        {
          Question: "اگر بیمه ناممم گم بشه تخفیف عدم خسارت حفظ میشه؟",
          Answer:
            "تخفیف‌ها عدم خسارت شما در صورت گم شدن بیمه‌نامه از بین نمی‌رود اما برای تمدید بیمه‌نامه خود در موعد سررسید، باید از همان شرکت بیمه‌گر قبلی اقدام به تمدید کنید تا تخفیف‌های عدم خسارت بیمه شخص ثالث شما لحاظ شود.",
        },
      ],
    },
    mutations: {
      Menu(state, data) {
        state.Menu = data;
      },
      Social(state, data) {
        state.Social = data;
      },
      Accounts(state, data) {
        state.Accounts = data;
      },
      MenuMobileBtn(state) {
        state.MenuMobile = !state.MenuMobile;
      },
      Banner(state, data) {
        state.Banner = data;
      },
      Gif(state, data) {
        state.Gif = URL.createObjectURL(data);
      },
      InsurancesList(state, data) {
        state.InsurancesList = data;
      },
      InsuranceStep(state, data) {
        state.InsuranceStep = data;
      },
      InsuranceInfo(state, data) {
        state.InsuranceInfo = data;
      },
      HandelInputInsurence(state, { Data, index }) {
        state.insurancesInput[index].Value = Data;
      },
    },
    actions: {
      async SupabaseMenu({ commit }) {
        try {
          const { data } = await supabase.from("Menu").select("*");
          commit("Menu", data);
        } catch (error) {
          console.log(error.message);
          console.log("لیست منو دریافت نشد");
        }
      },
      async SupabaseSocial({ commit }) {
        try {
          const { data } = await supabase.from("Social").select("*");
          commit("Social", data);
        } catch (error) {
          console.log(error.message);
          console.log("لیست منو دریافت نشد");
        }
      },
      async SupabaseAccounts({ commit }) {
        try {
          const { data } = await supabase.from("Accounts").select("*");
          commit("Accounts", data);
        } catch (error) {
          console.log(error.message);
          console.log("لیست منو دریافت نشد");
        }
      },
      async SupabaseBanner({ commit }) {
        try {
          const { data } = await supabase.from("Banner").select("*");
          commit("Banner", data);
        } catch (error) {
          console.log(error.message);
          console.log("اطلاعات بنر های قرمز زرد و سبز دریافت نشد");
        }
      },
      async SupabaseInsuranceStep({ commit }) {
        try {
          const { data } = await supabase.from("InsuranceCar").select("*");
          commit("InsuranceStep", data);
        } catch (error) {
          console.log(error.message);
          console.log("اطلاعات،فرم دریافت نشد");
        }
      },
      async SupabaseInsuranceInfo({ commit }) {
        try {
          const { data } = await supabase.from("InsuranceInfo").select("*");
          commit("InsuranceInfo", data);
        } catch (error) {
          console.log(error.message);
          console.log("اطلاعات،لیست دریافت نشد");
        }
      },
      async SupabaseGif({ commit }) {
        try {
          const { data } = await supabase.storage
            .from("public")
            .download("gif/animate-care6.gif");
          commit("Gif", data);
        } catch (error) {
          console.log(error.message);
          console.log("گیف دریافت نشد");
        }
      },
      async SupabaseInsurancesList({ commit }) {
        try {
          const InsurancesList = [];
          for (let index = 1; index < 13; index++) {
            const { data } = await supabase.storage
              .from("public")
              .download(`insurances/Bimeh/${index}.png`);
            InsurancesList.push(URL.createObjectURL(data));
          }
          commit("InsurancesList", InsurancesList);
        } catch (error) {
          console.log(error.message);
          console.log("گیف دریافت نشد");
        }
      },
    },
    getters: {
      StateGetter: (state) => (name) => {
        return state[name];
      },
    },
    modules: {},

    strict: process.env.DEBUGGING,
  });

  return Store;
});
